app/views/genres/show.html.erb

    <tbody>
        <% @genre.subgenres.each do |subgenre| %>
---
SELECT "subgenres".* FROM "subgenres" WHERE "subgenres"."genre_id" = ?  [["genre_id", 1]]