app/views/subgenres/show.html.erb

    <tbody>
        <% @subgenre.quizzs.each do |quiz| %>
---
SELECT "quizzs".* FROM "quizzs" WHERE "quizzs"."subgenre_id" = ?  [["subgenre_id", 1]]