app/controllers/genres_controller.rb

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@genre = Genre.find_by(id: params[:id])

INSERT INTO "genres" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Movies"], ["created_at", "2017-09-17 08:04:15.437033"], ["updated_at", "2017-09-17 08:04:15.437033"]]
---
  def create
      authorize
      @genre = Genre.new(genre_params)
      if @genre.save

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def edit
  @genre = Genre.find_by(id: params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["name", "Gameofthronesislove"], ["updated_at", "2017-09-19 16:07:48.245336"], ["id", 1]]
---
  def update
    authorize
    @genre = Genre.find_by(id: params[:id])
    if @genre.update_attributes(genre_params)

DELETE FROM "genres" WHERE "genres"."id" = ?  [["id", 2]]
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    authorize
    Genre.find_by(id: params[:id]).destroy