app/controllers/leaderboard_controller.rb

	def index
		@genre = Genre.find_by(id: params[:id])
		@genrescs = Genrescore.where(genre_id: params[:id]).order("score DESC")
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT "genrescores".* FROM "genrescores" WHERE "genrescores"."genre_id" = ? ORDER BY score DESC  [["genre_id", 1]]

	def show
		@subgenre = Subgenre.find_by(id: params[:id])
		@subgenrescs = Subgenrescore.where(subgenre_id: params[:id]).order("score DESC")
---
SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "subgenrescores".* FROM "subgenrescores" WHERE "subgenrescores"."subgenre_id" = ? ORDER BY score DESC  [["subgenre_id", 1]]