app/controllers/play_controller.rb

	def show
		curstate =current_user.states.find_by(quizz_id: params[:id])
		ques = current_user.quesusers.find_by(quizid: params[:id])

		@question = Question.find_by(id: ques.question_id)
---
SELECT  "states".* FROM "states" WHERE "states"."user_id" = ? AND "states"."quizz_id" = ? LIMIT ?  [["user_id", 1], ["quizz_id", 1], ["LIMIT", 1]]
SELECT  "quesusers".* FROM "quesusers" WHERE "quesusers"."user_id" = ? AND "quesusers"."quiz_id" = ? LIMIT ?  [["user_id", 1], ["quiz_id", "1"], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def update
		ques = current_user.quesusers.find_by(quizid: params[:id])
		question = Question.find_by(id: ques.question_id)
		curstate = current_user.states.find_by(quizz_id: params[:id])
		givenanswer = "#{params[:question][:optionA]}#{params[:question][:optionB]}#{params[:question][:optionC]}#{params[:question][:optionD]}"

		if givenanswer ==  question.answer
			curstate.score += question.points
		end

		curstate.count+=1
		curstate.save

		ques.destroy
		ques = current_user.quesusers.find_by(quizid: params[:id])
		if ques == nil
			curstate.complete = 1
			qid = curstate.quizz_id


			curquiz = Quizz.find_by(id: qid)
			sid = curquiz.subgenre.id
			gid = curquiz.subgenre.genre_id

			genresc = Genrescore.find_by(user_id: current_user.id, genre_id: gid)
			if genresc == nil
				Genrescore.create(user_id: current_user.id , genre_id: gid , score: curstate.score)
			else
				genresc.score+=curstate.score
				genresc.save
			end

			subgenresc = Subgenrescore.find_by(user_id: current_user.id, subgenre_id: gid)
			if genresc == nil
				Subgenrescore.create(user_id: current_user.id , subgenre_id: gid , score: curstate.score)
---
SELECT  "quesusers".* FROM "quesusers" WHERE "quesusers"."user_id" = ? AND "quesusers"."quizid" = ? LIMIT ?  [["user_id", 1], ["quizid", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "states".* FROM "states" WHERE "states"."user_id" = ? AND "states"."quizz_id" = ? LIMIT ?  [["user_id", 1], ["quizz_id", 1], ["LIMIT", 1]]
UPDATE "states" SET "score" = ?, "count" = ?, "updated_at" = ? WHERE "states"."id" = ?  [["score", 5], ["count", 1], ["updated_at", "2017-09-15 20:26:07.393168"], ["id", 12]]
DELETE FROM "quesusers" WHERE "quesusers"."id" = ?  [["id", 6]]
SELECT  "quizzs".* FROM "quizzs" WHERE "quizzs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "genrescores".* FROM "genrescores" WHERE "genrescores"."user_id" = ? AND "genrescores"."genre_id" = ? LIMIT ?  [["user_id", 1], ["genre_id", 1], ["LIMIT", 1]]
INSERT INTO "genrescores" ("user_id", "genre_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["genre_id", 1], ["score", 10], ["created_at", "2017-09-16 11:13:57.027084"], ["updated_at", "2017-09-16 11:13:57.027084"]]
UPDATE "genrescores" SET "score" = ?, "updated_at" = ? WHERE "genrescores"."id" = ?  [["score", 15], ["updated_at", "2017-09-20 10:38:57.962791"], ["id", 6]]
SELECT  "subgenrescores".* FROM "subgenrescores" WHERE "subgenrescores"."user_id" = ? AND "subgenrescores"."subgenre_id" = ? LIMIT ?  [["user_id", 1], ["subgenre_id", 1], ["LIMIT", 1]]
INSERT INTO "subgenrescores" ("user_id", "subgenre_id", "score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["subgenre_id", 1], ["score", 10], ["created_at", "2017-09-16 11:13:57.166946"], ["updated_at", "2017-09-16 11:13:57.166946"]]