app/controllers/questions_controller.rb

  def show
  	@question = Question.find_by(id: params[:id])
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
      authorize
      @question = Question.new(question_params)
      if @question.save
---
INSERT INTO "questions" ("content", "optionA", "optionB", "optionC", "optionD", "answer", "qtype", "points", "quizz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)