app/controllers/quizzs_controller.rb

SELECT  "states".* FROM "states" WHERE "states"."user_id" = ? AND "states"."quizz_id" = ? LIMIT ?  [["user_id", 1], ["quizz_id", 1], ["LIMIT", 1]]
INSERT INTO "states" ("user_id", "quizz_id", "complete", "score", "count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["quizz_id", 1], ["complete", "f"], ["score", 0], ["count", 0], ["created_at", "2017-09-15 16:40:37.688648"], ["updated_at", "2017-09-15 16:40:37.688648"]]
SELECT  "quizzs".* FROM "quizzs" WHERE "quizzs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "quesusers" ("user_id", "question_id", "quizid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["question_id", 1], ["quizid", 1], ["created_at", "2017-09-15 17:36:58.376108"], ["updated_at", "2017-09-15 17:36:58.376108"]]
---
	def show
		if current_user == nil
			#not logged in
			redirect_to login_path , notice:"You must login to continue"
		else
			curstate = current_user.states.find_by(quizz_id:  params[:id])
			#no entry in table

			if curstate ==  nil
				#create entry in states
				current_user.states.create(quizz_id: params[:id], complete: 0, score: 0, count: 0)
            	#enter the questions in the quesuser table
            	curquiz = Quizz.find_by(id: params[:id])
            	print curquiz
            	curquiz.questions.each do |question|
            		current_user.quesusers.create(question_id: question.id, quizid: curquiz.id)

INSERT INTO "quizzs" ("name", "numquestions", "subgenre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Personality"], ["numquestions", 4], ["subgenre_id", 4], ["created_at", "2017-09-19 20:37:06.029673"], ["updated_at", "2017-09-19 20:37:06.029673"]]
---
  	def create
      authorize
      @quizz = Quizz.new(quizz_params)
      if @quizz.save