app/controllers/sessions_controller.rb

  def create
    if logged_in? == true
      redirect_to root_path
    end
  	user = User.find_by(email: params[:session][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "nirvan@gmail.com"], ["LIMIT", 1]]