app/controllers/subgenres_controller.rb

SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def show
		@subgenre = Subgenre.find_by(id: params[:id])

SELECT "subgenres".* FROM "subgenres"
---
	def index
		@subgenres = Subgenre.all

INSERT INTO "subgenres" ("name", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "LOLA"], ["genre_id", 1], ["created_at", "2017-09-19 14:29:24.067301"], ["updated_at", "2017-09-19 14:29:24.067301"]]
---
  def create
      authorize
      @subgenre = Subgenre.new(subgenre_params)
      if @subgenre.save

SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subgenre = Subgenre.find_by(id: params[:id])

SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "subgenres" SET "name" = ?, "updated_at" = ? WHERE "subgenres"."id" = ?  [["name", "Season1Ep"], ["updated_at", "2017-09-19 16:38:56.946965"], ["id", 1]]
---
  def update
    authorize
    @subgenre = Subgenre.find_by(id: params[:id])
    if @subgenre.update_attributes(subgenre_params)

DELETE FROM "subgenres" WHERE "subgenres"."id" = ?  [["id", 2]]
SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def destroy
    authorize
    Subgenre.find_by(id: params[:id]).destroy