app/controllers/users_controller.rb

  def show
      validate(params[:id])
      @user = User.find_by(id: params[:id])
      @arr = Array.new
      @quizzes = Quizz.all
      @quizzes.each do |qui|
        curquiz = State.find_by(user_id: current_user.id , quizz_id: qui.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "quizzs".* FROM "quizzs"
SELECT  "states".* FROM "states" WHERE "states"."user_id" = ? AND "states"."quizz_id" = ? LIMIT ?  [["user_id", 3], ["quizz_id", 1], ["LIMIT", 1]]

  def index
      validate(params[:id])
  		@users = User.all
---
SELECT "users".* FROM "users"

  def create
       if logged_in? == true
      redirect_to root_path
      end
      @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

   def destroy
    authorize
    User.find_by(id: params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]